Дошкольное_учреждение83/src/Documents/удуПриказОЗачисленииРебенкаВГруппу/удуПриказОЗачисленииРебенкаВГруппу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуПриказОЗачисленииРебенкаВГруппу</name>
  <registerRecords>InformationRegister.удуСведенияОЗачисленииРебенкаВГруппу</registerRecords>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьКонтрольВместимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактическогоЗачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКомплектация</name>
    <type>
      <types>DocumentRef.удуКомплектованиеГруппы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьЗачисление</name>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеЗачисления</name>
      <type>
        <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/InformationRegisters/удуСведенияОЗачисленииРебенкаВГруппу/удуСведенияОЗачисленииРебенкаВГруппу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуСведенияОЗачисленииРебенкаВГруппу</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОснованиеЗачисления</name>
    <type>
      <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеУчетаВГруппе</name>
    <type>
      <types>EnumRef.удуСостояниеРебенкаНаУчетеВГруппе</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаВыбытияИзГруппы</name>
    <type>
      <types>CatalogRef.удуПричиныВыбытияИзГруппы</types>
    </type>
  </resources>
  <dimensions>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Enums/удуСостояниеРебенкаНаУчетеВГруппе/удуСостояниеРебенкаНаУчетеВГруппе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуСостояниеРебенкаНаУчетеВГруппе</name>
  <enumValues>
    <name>ПринятВГруппу</name>
  </enumValues>
  <enumValues>
    <name>ИсключенИзГруппы</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Enums/удуСтатусРебенкаВДОУ/удуСтатусРебенкаВДОУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуСтатусРебенкаВДОУ</name>
  <enumValues>
    <name>Кандидат</name>
  </enumValues>
  <enumValues>
    <name>Воспитанник</name>
  </enumValues>
  <enumValues>
    <name>Выпускник</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/удуГруппыУчреждения/удуГруппыУчреждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуГруппыУчреждения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Вместительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасформирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСведения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпенсирующаяНаправленность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БезОграниченияВместительности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправленностьГруппы</name>
    <type>
      <types>EnumRef.удуТипыНаправленностиГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетализацияНаправленности</name>
    <type>
      <types>CatalogRef.удуДетализацияНаправленностиГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозрастнойПризнак</name>
    <type>
      <types>CatalogRef.удуВозрастныеПризнаки</types>
    </type>
  </attributes>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.удуГрафикиРаботы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВоспитательныйПерсонал</name>
    <attributes>
      <name>РаботникУчреждения</name>
      <type>
        <types>CatalogRef.удуСотрудникиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Documents/удуПриказОЗачисленииРебенкаВГруппу/ObjectModule.bsl
Функция ПроверитьНаличиеМестВУказаннойГруппе()	
	Если Не Группа.БезОграниченияВместительности Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок
		               |ИЗ
		               |	РегистрСведений.удуСведенияОЗачисленииРебенкаВГруппу.СрезПоследних(
		               |			,
		               |			Группа = &Группа
		               |				И Учреждение = &Учреждение
		               |				И СостояниеУчетаВГруппе = &СостоитНаУчете) КАК удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних";
					   
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Учреждение", Учреждение);
		Запрос.УстановитьПараметр("Группа", Группа);
		Запрос.УстановитьПараметр("СостоитНаУчете", Перечисления.удуСостояниеРебенкаНаУчетеВГруппе.ПринятВГруппу);
		
		КоличествоИмеющихсяДетей = Запрос.Выполнить().Выгрузить().Количество();
		
		Если (КоличествоИмеющихсяДетей + ТабличнаяЧастьЗачисление.Количество()) > Группа.Вместительность Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Превышена допустимая вместительность группы!" + Символы.ПС + 
			"Допустимая вместительность группы составляет: " + Строка(Группа.Вместительность) + " детей" + Символы.ПС + 
			?(КоличествоИмеющихсяДетей > Группа.Вместительность, "", "Количество свободных (оставшихся) мест: " + Строка(Группа.Вместительность - КоличествоИмеющихсяДетей) + Символы.ПС) + 
			"Количество зачисляемых детей: " + Строка(ТабличнаяЧастьЗачисление.Количество()) + Символы.ПС + 
			"Для принудительного проведения документа установитье флаг ""Отключить контроль вместимости группы""'");			
			Сообщение.Поле = НСтр("ru = 'ТабличнаяЧастьЗачисление'");
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();			
			Возврат ?(ОтключитьКонтрольВместимости, Ложь, Истина);
		Иначе
			Возврат Ложь;
		КонецЕсли;		
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции


Процедура ОбработкаПроведения(Отказ, Режим)
	// сначала проверим превышение вместительности группы
	Отказ = ПроверитьНаличиеМестВУказаннойГруппе();
	
	// теперь для каждого ребенка проверим нахождение в других группах
	Если Не Отказ Тогда
		СписокДетей = Новый СписокЗначений;
		Для Каждого СтрокаТабличнойЧасти Из ТабличнаяЧастьЗачисление Цикл
			СписокДетей.Добавить(СтрокаТабличнойЧасти.ОснованиеЗачисления.Ребенок);
		КонецЦикла;
		
		Текстзапроса = "ВЫБРАТЬ
		               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Группа,
		               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.СостояниеУчетаВГруппе,
		               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.ОснованиеЗачисления,
		               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок
		               |ИЗ
		               |	РегистрСведений.удуСведенияОЗачисленииРебенкаВГруппу.СрезПоследних(&ДатаЗачисления, ) КАК удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних
		               |ГДЕ
		               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок В(&СписокДетей)
		               |	И удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Группа <> &ТекущаяГруппа";
					   
		Запрос = Новый Запрос(Текстзапроса);
		Запрос.УстановитьПараметр("ДатаЗачисления", ДатаФактическогоЗачисления);
		Запрос.УстановитьПараметр("СписокДетей", СписокДетей);
		Запрос.УстановитьПараметр("ТекущаяГруппа", Группа);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();

		Если РезультатЗапроса.Количество() > 0 Тогда 
			Для Каждого СтрокаРезультатЗапроса Из РезультатЗапроса Цикл
				Если СтрокаРезультатЗапроса.СостояниеУчетаВГруппе = Перечисления.удуСостояниеРебенкаНаУчетеВГруппе.ПринятВГруппу Тогда
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = НСтр("ru = 'Ребенок: " + СокрЛП(СтрокаРезультатЗапроса.Ребенок.Наименование) + " уже включен в группу " + СокрЛП(СтрокаРезультатЗапроса.Группа.Наименование) + " на основании: " + СокрЛП(СтрокаРезультатЗапроса.ОснованиеЗачисления) + "'");
					НомерСтрокиДокумента = Строка(ТабличнаяЧастьЗачисление.Найти(СтрокаРезультатЗапроса.Ребенок).НомерСтроки - 1);
					Сообщение.Поле = НСтр("ru = 'ТабличнаяЧастьЗачисление[" + Формат(НомерСтрокиДокумента, "ЧГ=0") + "].Ребенок'");
					Сообщение.УстановитьДанные(ЭтотОбъект);
					Сообщение.Сообщить();
					
					Отказ = Истина;
				КонецЕсли;
			КонецЦикла;						
		КонецЕсли;	
	КонецЕсли;
	
	Если Не Отказ Тогда
		Движения.удуСведенияОЗачисленииРебенкаВГруппу.Записывать = Истина;
		Для Каждого ТекСтрокаТабличнаяЧастьЗачисление Из ТабличнаяЧастьЗачисление Цикл
			// регистр удуСведенияОЗачисленииРебенкаВГруппу 
			Движение = Движения.удуСведенияОЗачисленииРебенкаВГруппу.Добавить();
			Движение.Период = ДатаФактическогоЗачисления;
			Движение.Учреждение = Учреждение;
			Движение.Ребенок = ТекСтрокаТабличнаяЧастьЗачисление.ОснованиеЗачисления.Ребенок;
			Движение.Группа = Группа;
			Движение.ОснованиеЗачисления = ТекСтрокаТабличнаяЧастьЗачисление.ОснованиеЗачисления;
			Движение.СостояниеУчетаВГруппе = Перечисления.удуСостояниеРебенкаНаУчетеВГруппе.ПринятВГруппу;
			
			// Изменяем признак воспитанника в личном деле ребенка
			РебенокОбъект = ТекСтрокаТабличнаяЧастьЗачисление.ОснованиеЗачисления.Ребенок.ПолучитьОбъект();
			РебенокОбъект.СтатусРебенка = Перечисления.удуСтатусРебенкаВДОУ.Воспитанник;
			РебенокОбъект.Записать();
			
			// Изменяем признак отработки договора зачисления
			ДоговорОбъект = ТекСтрокаТабличнаяЧастьЗачисление.ОснованиеЗачисления.ПолучитьОбъект();
			ДоговорОбъект.ПроизошлоЗачисление = Истина;
			ДоговорОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			Если ЗначениеЗаполнено(ТекСтрокаТабличнаяЧастьЗачисление.ОснованиеЗачисления.ЗаявкаОснование) Тогда
				// Изменяем признак отработки завяки на зачисление
				ЗаявкаОбъект = ТекСтрокаТабличнаяЧастьЗачисление.ОснованиеЗачисления.ЗаявкаОснование.ПолучитьОбъект();
				ЗаявкаОбъект.ПризнакЗачисления = Истина;
				ЗаявкаОбъект.ГруппаПоФактуЗачисления = Группа;
				ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Запись);			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Вставить содержимое обработчика.
	Для Каждого ТекСтрокаТабличнаяЧастьЗачисление Из ТабличнаяЧастьЗачисление Цикл		
		// Изменяем признак воспитанника в личном деле ребенка
		РебенокОбъект = ТекСтрокаТабличнаяЧастьЗачисление.ОснованиеЗачисления.Ребенок.ПолучитьОбъект();
		РебенокОбъект.СтатусРебенка = Перечисления.удуСтатусРебенкаВДОУ.Кандидат;
		РебенокОбъект.Записать();
		
		// Изменяем признак отработки договора зачисления
		ДоговорОбъект = ТекСтрокаТабличнаяЧастьЗачисление.ОснованиеЗачисления.ПолучитьОбъект();
		ДоговорОбъект.ПроизошлоЗачисление = Ложь;
		ДоговорОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		// Изменяем признак отработки завяки на зачисление
		Если ЗначениеЗаполнено(ТекСтрокаТабличнаяЧастьЗачисление.ОснованиеЗачисления.ЗаявкаОснование) Тогда
			ЗаявкаОбъект = ТекСтрокаТабличнаяЧастьЗачисление.ОснованиеЗачисления.ЗаявкаОснование.ПолучитьОбъект();
			ЗаявкаОбъект.ПризнакЗачисления = Ложь;
			ЗаявкаОбъект.ГруппаПоФактуЗачисления = Справочники.удуГруппыУчреждения.ПустаяСсылка();
			ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Запись);		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры
